app/Controllers/ProdukController.php

    public function list() {
        $model = new MProduk();
        $produk = $model->findAll();
---
SELECT *
FROM `produk`

    public function detail($id) {
        $model = new MProduk();
        $produk = $model->find($id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'

    public function ubah($id)
    {
    $data = [
        'kode_produk' => $this->request->getVar('kode_produk'),
        'nama_produk' => $this->request->getVar('nama_produk'),
        'harga' => $this->request->getVar('harga')
    ];

    $model = new MProduk();
    $model->update($id, $data);
    $produk = $model->find($id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'

    public function hapus($id)
    {
    $model = new MProduk();
    $produk = $model->delete($id);
---
DELETE FROM `produk`
WHERE `id` IN ('1')